test/good/cell-overflow.cfg.dot
digraph "cell-overflow" {
    node [shape=box];
    subgraph "cluster_refs_num_bad" {
        label="refs_num_bad";
        "refs_num_bad_68" [label="let b1 = beginCell()"];
        "refs_num_bad_69" [label="b1 = b1.storeRef(c)"];
        "refs_num_bad_70" [label="b1 = b1.storeRef(c)"];
        "refs_num_bad_71" [label="b1 = b1.storeRef(c)"];
        "refs_num_bad_72" [label="b1 = b1.storeRef(c)"];
        "refs_num_bad_73" [label="b1 = b1.storeRef(c)"];
        "refs_num_bad_74" [label="let c1 = b1.endCell()"];
        "refs_num_bad_75" [label="let c2 = beginCell().storeRef(c).storeRef(c).storeRef(c).storeRef(c).storeRef(c).endCell()",style=filled,fillcolor="#66A7DB"];
        "refs_num_bad_68" -> "refs_num_bad_69";
        "refs_num_bad_69" -> "refs_num_bad_70";
        "refs_num_bad_70" -> "refs_num_bad_71";
        "refs_num_bad_71" -> "refs_num_bad_72";
        "refs_num_bad_72" -> "refs_num_bad_73";
        "refs_num_bad_73" -> "refs_num_bad_74";
        "refs_num_bad_74" -> "refs_num_bad_75";
    }
    subgraph "cluster_store_size_bad" {
        label="store_size_bad";
        "store_size_bad_76" [label="let b1 = beginCell()"];
        "store_size_bad_77" [label="b1 = b1.storeInt(42, 257)"];
        "store_size_bad_78" [label="b1 = b1.storeInt(42, 259 - 2)"];
        "store_size_bad_79" [label="b1 = b1.storeInt(42, 256 + 1)"];
        "store_size_bad_80" [label="b1 = b1.storeInt(42, 257)"];
        "store_size_bad_81" [label="let c1 = b1.endCell()"];
        "store_size_bad_82" [label="let b2 = beginCell()"];
        "store_size_bad_83" [label="b2 = b2.storeInt(1, 257).storeInt(1, 257).storeInt(1, 257).storeInt(1, 210)"];
        "store_size_bad_84" [label="b2 = b2.storeCoins(40000000000)"];
        "store_size_bad_85" [label="c1 = b2.endCell()"];
        "store_size_bad_86" [label="let b_1000_bits = beginCell().storeInt(1, 257).storeInt(1, 257).storeInt(1, 257).storeInt(1, 229)"];
        "store_size_bad_87" [label="let b3 = beginCell()"];
        "store_size_bad_88" [label="b3 = b3.storeBuilder(b_1000_bits).storeInt(1, 25)"];
        "store_size_bad_89" [label="c1 = b3.endCell()",style=filled,fillcolor="#66A7DB"];
        "store_size_bad_76" -> "store_size_bad_77";
        "store_size_bad_77" -> "store_size_bad_78";
        "store_size_bad_78" -> "store_size_bad_79";
        "store_size_bad_79" -> "store_size_bad_80";
        "store_size_bad_80" -> "store_size_bad_81";
        "store_size_bad_81" -> "store_size_bad_82";
        "store_size_bad_82" -> "store_size_bad_83";
        "store_size_bad_83" -> "store_size_bad_84";
        "store_size_bad_84" -> "store_size_bad_85";
        "store_size_bad_85" -> "store_size_bad_86";
        "store_size_bad_86" -> "store_size_bad_87";
        "store_size_bad_87" -> "store_size_bad_88";
        "store_size_bad_88" -> "store_size_bad_89";
    }
    subgraph "cluster_refs_num_ok" {
        label="refs_num_ok";
        "refs_num_ok_90" [label="let c1 = beginCell().storeRef(c).storeRef(c).storeRef(c).storeMaybeRef(copt).storeRef(c).endCell()"];
        "refs_num_ok_91" [label="let b1 = beginCell()"];
        "refs_num_ok_92" [label="b1.storeRef(c)"];
        "refs_num_ok_93" [label="b1.storeRef(c)"];
        "refs_num_ok_94" [label="b1.storeRef(c)"];
        "refs_num_ok_95" [label="b1.storeRef(c)"];
        "refs_num_ok_96" [label="b1.storeRef(c)"];
        "refs_num_ok_97" [label="c1 = b1.endCell()",style=filled,fillcolor="#66A7DB"];
        "refs_num_ok_90" -> "refs_num_ok_91";
        "refs_num_ok_91" -> "refs_num_ok_92";
        "refs_num_ok_92" -> "refs_num_ok_93";
        "refs_num_ok_93" -> "refs_num_ok_94";
        "refs_num_ok_94" -> "refs_num_ok_95";
        "refs_num_ok_95" -> "refs_num_ok_96";
        "refs_num_ok_96" -> "refs_num_ok_97";
    }
}
